In [106]:
a=5

In [107]:
print(a)

5

Data Types

In [108]:
a=5

In [109]:
type(a)

int

In [110]:
b="saurabh"

In [111]:
type(b)

str

Conditiuonal Statement

Take a variable x and print "Even" if the number is divisiable by 2, otherwise print "odd".

In [112]:
x=int(input("Enter a Number : "))
if(x%2==0):
    print("Even")
else:
    print("Odd")

Enter a Number : 1
Odd

Take a variable y and print "Grade A" if y is grater than 90,"Grade B" if y is grater than 60 but less then or equal to 90 and "Grade F" otherwise.

In [113]:
y=int(input("Enter Number : "))
if(y>90):
    print("Grade A")
elif(y>60 and y<=90):
    print("Grade B")
else:
    print("Grade F")

Enter Number : 1
Grade F

# Functions

In [114]:
def compare(a,b):
    if(a>b):
        greater=a
    
    else:
        greater=b
    return greater

In [115]:
compare(14,5)

14

# List Data Structure

In [116]:
# creating a list
marks=[1,2,3,4,5,7,8]

In [117]:
marks[5]

7

In [118]:
marks[0:6]

[1, 2, 3, 4, 5, 7]

In [119]:
#adding elements
marks.append(11)

In [120]:
marks

[1, 2, 3, 4, 5, 7, 8, 11]

In [121]:
marks.extend([12,13])

In [122]:
marks

[1, 2, 3, 4, 5, 7, 8, 11, 12, 13]

In [11]:
# delating element
marks=[1,2,3,4,5,7,8] 
marks.remove(2)
marks

[1, 3, 4, 5, 7, 8]

# Dictionaries

Get All Keys

In [12]:
a = {"1":1, "2":2, "3":3}
b = {"2":2, "3":3, "4":4}
a.keys()

dict_keys(['1', '2', '3'])

In [13]:
#Get Key and Value
a = {"1":1, "2":2, "3":3}
a.items()

dict_items([('1', 1), ('2', 2), ('3', 3)])

In [24]:
#create a dictionary
marks={'history':45,'geography':54,'hindi':56}

In [25]:
#access element
marks['geography']

54

In [26]:
#adding single element
marks['english']=47
marks

{'history': 45, 'geography': 54, 'hindi': 56, 'english': 47}

In [27]:
# adding multiple element
marks.update({'chemistry':89,'physics':45})
marks

{'history': 45,
 'geography': 54,
 'hindi': 56,
 'english': 47,
 'chemistry': 89,
 'physics': 45}

In [38]:
#delating element
del marks['hindi']
marks

KeyError: 'hindi'

# CSV File

In [3]:
#importing pandas library
import pandas as pd

In [6]:
#reading the CSV File
df=pd.read_csv('D:\Internsala\Data Science\Python foe data science\data.csv')

In [7]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
#reading Excel File
df1=pd.read_excel("D:\Internsala\Data Science\Python foe data science\data.xlsx")

In [10]:
df1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# DataFrames

In [11]:
#importing libraries
import pandas as pd

In [12]:
#reading the data set
df=pd.read_csv('D:\Internsala\Data Science\Python foe data science\data.csv')

In [13]:
# seeing the dimensions of the df data frame
df.shape

(891, 12)

In [14]:
#First top 5 rows 
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [15]:
#Bottom 10 rows
df.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [17]:
#seeing the name of column in dataframe
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [18]:
#select a single column
df['Survived']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [19]:
#select multiple columns using name
df[['Survived','Ticket']]

     Survived            Ticket
0           0         A/5 21171
1           1          PC 17599
2           1  STON/O2. 3101282
3           1            113803
4           0            373450
..        ...               ...
886         0            211536
887         1            112053
888         0        W./C. 6607
889         1            111369
890         0            370376

[891 rows x 2 columns]

# Indexing/selection etc

In [20]:
#importing libraries
import pandas as pd

In [21]:
 #reading the CSV File
df=pd.read_csv('D:\Internsala\Data Science\Python foe data science\spreadsheet.csv')

In [22]:
#viewing the first few rows using head
df.head()

,ID,Clump_Thickness,Cell_Size_Uniformity,Cell_Shape_Uniformity,Marginal_Adhesion,Single_Epithelial_Cell_Size,Bare_Nuclei,Bland_Chromatin,Normal_Nucleoli,Mitoses,Cancer_Type
0,1000025,5,1,1,1,2.0,1,3,1,1,2
1,1002945,5,4,4,5,NaN,10,3,2,1,2
2,1015425,3,1,1,1,2.0,2,3,1,1,2
3,1016277,6,8,8,1,3.0,4,3,7,1,2
4,1017023,4,1,1,3,2.0,1,3,1,1,2

In [24]:
 #selecting a single column by name
df['Bare_Nuclei']

0       1
1      10
2       2
3       4
4       1
       ..
694     2
695     1
696     3
697     4
698     5
Name: Bare_Nuclei, Length: 699, dtype: object

In [25]:
#selecting multiple columns using column name
df[['Bare_Nuclei','ID']]

    Bare_Nuclei       ID
0             1  1000025
1            10  1002945
2             2  1015425
3             4  1016277
4             1  1017023
..          ...      ...
694           2   776715
695           1   841769
696           3   888820
697           4   897471
698           5   897471

[699 rows x 2 columns]

In [26]:
#select rows by their positions
df.iloc[:5]

,ID,Clump_Thickness,Cell_Size_Uniformity,Cell_Shape_Uniformity,Marginal_Adhesion,Single_Epithelial_Cell_Size,Bare_Nuclei,Bland_Chromatin,Normal_Nucleoli,Mitoses,Cancer_Type
0,1000025,5,1,1,1,2.0,1,3,1,1,2
1,1002945,5,4,4,5,NaN,10,3,2,1,2
2,1015425,3,1,1,1,2.0,2,3,1,1,2
3,1016277,6,8,8,1,3.0,4,3,7,1,2
4,1017023,4,1,1,3,2.0,1,3,1,1,2

In [27]:
#select column by their positions
df.iloc[:,:2]#select all row with first 2 column

          ID  Clump_Thickness
0    1000025                5
1    1002945                5
2    1015425                3
3    1016277                6
4    1017023                4
..       ...              ...
694   776715                3
695   841769                2
696   888820                5
697   897471                4
698   897471                4

[699 rows x 2 columns]

In [28]:
df[df['Clump_Thickness']==5]

,ID,Clump_Thickness,Cell_Size_Uniformity,Cell_Shape_Uniformity,Marginal_Adhesion,Single_Epithelial_Cell_Size,Bare_Nuclei,Bland_Chromatin,Normal_Nucleoli,Mitoses,Cancer_Type
0,1000025,5,1,1,1,2.0,1,3,1,1,2
1,1002945,5,4,4,5,NaN,10,3,2,1,2
12,1041801,5,3,3,3,2.0,3,4,4,1,4
25,1065726,5,2,3,4,2.0,7,3,6,1,4
27,1066979,5,1,1,1,2.0,1,2,1,1,2
...,...,...,...,...,...,...,...,...,...,...,...
677,1368267,5,1,1,1,2.0,1,1,1,1,2
681,1371026,5,10,10,10,4.0,10,5,6,3,4
682,1371920,5,1,1,1,2.0,1,3,2,1,2
691,695091,5,10,10,5,4.0,5,4,4,1,4
696,888820,5,10,10,3,7.0,3,8,10,2,4